{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-FNAME",
    "1": "B-SNAME",
    "2": "B-SUFFIX",
    "3": "B-SURNAME",
    "4": "B-TITLE",
    "5": "I-SNAME",
    "6": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-FNAME": 0,
    "B-SNAME": 1,
    "B-SUFFIX": 2,
    "B-SURNAME": 3,
    "B-TITLE": 4,
    "I-SNAME": 5,
    "O": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 30522
}
